{"data":{"Article":{"html":"<h1>Using Tables</h1>\n<p>For data sources that support a native query syntax (SQL or NOSQL), you can choose your data return format, which columns to return, and in what order by modifying your query. But sources like CSV files or Google Sheets don't support a query syntax. So Redash allows you to manually reorder, hide, and format data in your table visualizations.</p>\n<p>{% callout info %}\nIf you absolutely depend on a feature of SQL, you can use the <a href=\"%7B%25%20link%20_kb/user-guide/querying/query-results-data-source.md%20%25%7D\">Query Results Data Source</a> to post-process your data.\n{% endcallout %}</p>\n<h2>Visualization Settings</h2>\n<p>To get started, click the <code>Edit Visualization</code> button under the table view. A settings panel appears that looks like this:</p>\n<p><img src=\"/assets/images/docs/gitbook/table-viz-options.png\"></p>\n<p>You can: </p>\n<ul>\n<li><strong>Reorder Columns</strong> by dragging them to the left or right as shown in the yellow highlight.</li>\n<li><strong>Hide Columns</strong> by toggling the check mark highlighted in green</li>\n<li><strong>Format Columns</strong> using the format settings highlighted red. Read more about column formatting below.</li>\n</ul>\n<h1>Formatting Columns</h1>\n<p>Redash is sensitive to the data types that are common to most databases: text, numbers, dates and booleans. But it also has special support for non-standard column types like JSON documents, images, and links.</p>\n<h2><strong>Common Data Types</strong></h2>\n<p>Redash will render a column as text if your underlying data source does not provide type information. But you can force it to use arbitrary types using the table visualization editor. This is especially useful for sources like SQLite, Google Sheets, or CSV files where type data is not available. You can, for example:</p>\n<ul>\n<li>Display all floats out to three decimal places</li>\n<li>Show only the month and year of a date column</li>\n<li>Zero-pad all integers</li>\n<li>Prepend or Append text to your number fields</li>\n</ul>\n<p>A full reference for rendering numbers in Redash is available <a href=\"%7B%25%20link%20_kb/user-guide/visualizations/formatting-numbers.md%20%25%7D\">here</a>. You can read about how to format dates <a href=\"https://momentjs.com/docs/#/displaying/format/\">here</a>.</p>\n<h2><strong>Special Data Types</strong></h2>\n<p>Redash also supports data types outside the common database specifications.</p>\n<ul>\n<li>\n<p><strong>JSON Documents</strong></p>\n<p>If you're underlying data returns JSON formatted text in a field, you can instruct Redash to display it as such. This lets you collapse and expand elements in a clean format. This is particularly useful when querying RESTful APIs with the <a href=\"%7B%25%20link%20_kb/data-sources/querying/urls%20%25%7D\">JSON Data Source</a></p>\n</li>\n<li>\n<p><strong>Images</strong></p>\n<p>If a field in your database contains links to an image, Redash can display that image inline with your table results. This is especially useful for dashboards.</p>\n<p><img src=\"/assets/images/docs/gitbook/dashboard-with-images.png\"></p>\n<p>In the above dashboard, the <strong>Customer Image</strong> field is a URL to a picture which Redash displays in-place.</p>\n</li>\n<li>\n<p><strong>HTML Links</strong></p>\n<p>Just like with images, HTML links from your DB can be made clickable in Redash. Just use the Link option in the column format selector.</p>\n</li>\n</ul>","frontmatter":{"permalink":null,"title":"Table Visualization Options","description":null,"keywords":null,"parent_category":"user-guide","category":"visualizations","toc":true,"layout":null,"hide_topics":null},"parent":{"__typename":"File","relativePath":"kb/user-guide/visualizations/table-visualizations.md"}},"Parent":{"frontmatter":{"title":"Visualizations"}},"Section":{"name":"User Guide"}},"pageContext":{"category":"visualizations","parent_category":"user-guide","slug":"table-visualizations"}}