{"data":{"Article":{"html":"<p>Redash's permissions model based on groups and associated data sources. Group\nmembership defines the actions a user is allowed to take (although currently\nthere's no UI to edit group action permissions), and which data sources they\nhave access to (for this we have UI).</p>\n<h3>How does it work?</h3>\n<p>Each user belongs to one or more groups. By default, each user joins the\nDefault group. The common data sources should be associated with the Default\ngroup.</p>\n<p>Each data source will be associated with one or more groups. Each connection\nto a group will define, whether this group has <strong>Full access</strong> to this data\nsource (view existing queries and run new ones) or <strong>View Only access</strong> ,\nwhich allows only viewing existing queries and results.</p>\n<p>Any dashboard can contain visualizations from any data source (as long as the\ncreating user has access to them). When a user who doesn’t have access to a\nvisualization (because he doesn’t have access to the data source) opens a\ndashboard, he'll see where a visualization would be but won't be able to see\nany details. The screenshot shown below shows a Dashboard Widget with a\nvisualization the user doesn’t have access to.</p>\n<p><img src=\"/assets/images/docs/gitbook/restricted-widget.png\"></p>\n<p>If a user has access to at least one widget on a dashboard, they'll be able to\nsee the dashboard in the list of all dashboards.</p>\n<h3>What if I want to limit the user to only some tables?</h3>\n<p>The idea is to leverage your database’s security model and hence create a user\nwith access to the tables/columns you want to give access to. Create a data\nsource that's using this user and then associate it with a group of users who\nneed this level of access.</p>","frontmatter":{"permalink":null,"title":"Permissions & Groups","description":null,"keywords":null,"parent_category":"user-guide","category":"users","toc":null,"layout":null,"hide_topics":null},"parent":{"__typename":"File","relativePath":"kb/user-guide/users/permissions-groups.md"}},"Parent":{"frontmatter":{"title":"User, Groups, & Permissions"}},"Section":{"name":"User Guide"}},"pageContext":{"category":"users","parent_category":"user-guide","slug":"permissions-groups"}}