{"data":{"Article":{"html":"<p>Authentication settings are available in the <code>Settings</code>><code>Settings</code> tab.</p>\n<p><img src=\"/assets/images/docs/gitbook/settings-saml.png\"></p>\n<p>{% callout %}\nOnly admins can view and change authentication settings.\n{% endcallout %}</p>\n<p>There are 3 authentication related settings here:</p>\n<ol>\n<li>Enable/disable password based login.</li>\n<li>Google SSO: add Google Apps based domains to allow login from. Any user with a Google account from these domain(s) will be able to login. If they don't have an account yet, an account will be automatically created.</li>\n<li>Enable/disable SAML support.</li>\n</ol>\n<p>Once you enable SAML, additional settings will appear:</p>\n<p><img src=\"/assets/images/docs/gitbook/saml-details.png\"></p>\n<ol>\n<li>SAML Metadata URL is required to make SAML authentication work. You can get this URL from your SAML provider like <a href=\"https://www.onelogin.com/connector/redash\">OneLogin</a>.</li>\n<li>Set up Redash callback URL in your SAML provider: <code>https://app.redash.io/saml/callback?org_slug=&#x3C;organization name></code>. If you have single organization name, set <code>default</code> as value for org_slug.</li>\n<li>Within SAML provider, map user fields FirstName and LastName to matching values as those two fields are mandatory for user creation.</li>\n</ol>\n<p>By default any user created with SAML/SSO will join the default group. It's possible to configure the SAML provider to pass what groups the user should join by setting the <code>RedashGroups</code> parameter. If you use OneLogin's predefined Redash application, it will always pass this parameter, meaning that even for existing users, it will override their current groups memberships. Hence you need to make sure it's up to date.</p>\n<h3>How to Configure Okta</h3>\n<p>It takes just a couple of minutes to setup Redash with Okta over the SAML 2.0 protocol. Start in your Okta control panel by clicking the button to add a new application. Choose <code>Web</code> as the platform. The sign-on method is <code>SAML 2.0</code>. On the next screen Okta has fields for a few URLs:</p>\n<ul>\n<li>Single Sign On URL</li>\n<li>Recipient URL</li>\n<li>Destination URL</li>\n<li>Audience URI</li>\n</ul>\n<p>You will use the same value in all of these fields. For SaaS customers, the URL is: <code>https://app.redash.io/org-slug/saml/callback</code></p>\n<p>{% callout info %}\nMake sure you replace <code>org-slug</code> in this URL with the unique slug for your organization.\n{% endcallout %}</p>\n<p>After you fill in these URLs, set the Name Id format to <code>EmailAddress</code>. The Application username is <code>Email</code>. You also need to add two attribute statements and then save your changes:</p>\n<table>\n<thead>\n<tr>\n<th>Name</th>\n<th>Value</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>FirstName</td>\n<td>user.firstName</td>\n</tr>\n<tr>\n<td>LastName</td>\n<td>user.lastName</td>\n</tr>\n</tbody>\n</table>\n<p>Next you will provide Okta's information to Redash. Navigate to the <code>Settings</code> tab under the Redash settings menu. Toggle the <code>SAML Enabled</code> option. Three fields will appear. For the <code>SAML Metadata URL</code>, look under the <strong>Sign On</strong> tab of your Okta settings for a link called \"Identity Provider Metadata\" and paste the link into Redash. This link will point to an XML document on Okta's server.</p>\n<p>To get the <code>SAML Entity ID</code>, click the \"View Setup Instructions\" button in Okta's <strong>Sign On</strong> tab. Paste the \"Identity Provider Single Sign-On URL\" into Redash's <code>SAML Entity ID</code> field.  </p>\n<p>Lastly, look for the \"IDP metadata\" on the setup instructions page in Okta. The \"IDP metadata\" is a blob of XML that contains a key called <code>&#x3C;md:NameIDFormat></code>. Paste its contents into Redash's <code>SAML NameID Format</code> box. For example: <code>urn:oasis:names:tc:SAML:1.1:nameid-format:emailAddress</code></p>\n<p>Your changes on this screen will save automatically. Now you can login to Redash using your Okta credentials.</p>\n<p>You can now log in to Redash using Okta SSO.</p>","frontmatter":{"permalink":null,"title":"Authentication Options (SSO, Google OAuth, SAML)","description":null,"keywords":null,"parent_category":"user-guide","category":"users","toc":null,"layout":null,"hide_topics":null},"parent":{"__typename":"File","relativePath":"kb/user-guide/users/authentication-options.md"}},"Parent":{"frontmatter":{"title":"User, Groups, & Permissions"}},"Section":{"name":"User Guide"}},"pageContext":{"category":"users","parent_category":"user-guide","slug":"authentication-options"}}