{"data":{"Article":{"html":"<p>Redash alerts can notify you when your <a href=\"%7B%25%20link%20_kb/user-guide/querying/scheduling-a-query.md%20%25%7D\"><strong>Scheduled Queries</strong></a> match some arbitrary criteria. Use them to monitor business data or integrated them with tools like Zapier or IFTTT to trigger business processes like user onbarding or support tickets. While Alerts are usually combined with scheduled queries, the Alert criteria will be evaluated every time the query is executed.</p>\n<p>{% callout warning %}</p>\n<p>A query schedule is not necessary but is <em>highly recommended</em> for alerts. If you configure an Alert without a query schedule you will only receive notifications if a user in your organization manually executes a given query.</p>\n<p>{% endcallout %}</p>\n<p>Click <code>Alerts</code> on the main navigation menu to see a list of the existing Alerts.</p>\n<p><img src=\"/assets/images/docs/gitbook/alerts.png\"></p>\n<h1>Usage</h1>\n<p>Create a new Alert by clicking the blue <code>Create</code> button in the navigation menu and selecting <code>Alert</code>.</p>\n<p><img src=\"/assets/images/docs/gitbook/create-alert.png\"></p>\n<p>Find the query that you would like to monitor using the search bar. Keep in mind that Alerts do not work with queries that use parameters.</p>\n<p><img src=\"/assets/images/docs/gitbook/new-alert-query-search.png\"></p>\n<p>{% callout info %}</p>\n<p>If you set an Alert for a query that returns more than one row of data, the Alert will only read the first row of data.</p>\n<p>{% endcallout %}</p>\n<p>Use the settings panel to configure your alert:</p>\n<p><img src=\"/assets/images/docs/gitbook/alerts_settings.png\"></p>\n<ul>\n<li><strong>Value Column</strong> is the column in your query result that you would like to watch.</li>\n<li><strong>Op</strong> is short for \"Operator\". You can choose greater than, less than, or equal to.</li>\n<li><strong>Reference</strong> is the absolute value that your <em>Value Column</em> will be compared to. The most recent query result is shown as the <strong>Value</strong></li>\n<li><strong>Rearm seconds</strong> effects how frequently you will receive notifications when your query meets the Alert criteria and does not change. See further discussion below.</li>\n</ul>\n<p>Save your alert. After you do this, you can add an <a href=\"%7B%25%20link%20_kb/user-guide/alerts/creating-new-alert-destination.md%20%25%7D\">alert destination</a>. If you skip this step you will not be notified when the alert is triggered.</p>\n<p><img src=\"/assets/images/docs/gitbook/alert_destination.png\"></p>\n<h1>Alert Status &#x26; Frequency</h1>\n<p>The status of your Alert criteria is checked every time the query is executed. Alerts have three possible statuses:</p>\n<ul>\n<li><code>TRIGGERED</code> means that your query matched the criteria defined in your alert configuration. If you set your alert to trigger when the value of \"cats\" is greater than 1500 as long as it's above 1500 your alert is triggered.</li>\n<li><code>OK</code> means that the most recent query execution did not match the criteria defined in your alert. This doesn't mean that the Alert has not been triggered previously. If your \"cats\" value is now 1470 your alert will show as OK.</li>\n<li><code>UNKNOWN</code> means Redash does not have enough data to evaluate the alert criteria. You should see this status immediately after creating your Alert until the query has executed. The Alert will also show this status if there was no data in the query result or if the most recent query result doesn't have the configured <em>Value Column</em>.</li>\n</ul>\n<p>Redash sends notifications to your chosen Alert Destinations whenever it detects that the Alert status has changed from <code>OK</code> to <code>TRIGGERED</code> or vice versa. Consider this example where an Alert is configured on a query that is scheduled to run once daily. The daily status of the Alert appears in the table below. Prior to Monday the alert status was <code>OK</code>.</p>\n<table>\n<thead>\n<tr>\n<th>Day</th>\n<th>Alert Status</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Monday</td>\n<td>OK</td>\n</tr>\n<tr>\n<td>Tuesday</td>\n<td>OK</td>\n</tr>\n<tr>\n<td>Wednesday</td>\n<td>TRIGGERED</td>\n</tr>\n<tr>\n<td>Thursday</td>\n<td>TRIGGERED</td>\n</tr>\n<tr>\n<td>Friday</td>\n<td>TRIGGERED</td>\n</tr>\n<tr>\n<td>Saturday</td>\n<td>TRIGGERED</td>\n</tr>\n<tr>\n<td>Sunday</td>\n<td>OK</td>\n</tr>\n</tbody>\n</table>\n<p>By default, Redash would send a notification on Wednesday when the status changed from <code>OK</code> to <code>TRIGGERED</code> and again on Sunday when it switches back. It will not send alerts on Thursday, Friday, or Saturday unless you specifically configure it to do so because the Alert status did not change between executions on those days.</p>\n<h2>Setting Rearm Seconds for an Alert</h2>\n<p>To send notifications more frequently, set the <strong>Rearm seconds</strong> to any nonzero value. This tells Redash to treat a <code>TRIGGERED</code> status after the chosen number of seconds as though the status has changed and therefore send a notification.</p>\n<p>For example, if the above Alert were configured with <strong>Rearm seconds</strong> equal to <code>1</code> a notification would be sent every day that the status was <code>TRIGGERED</code> (Wednesday - Saturday) and one on Sunday when the status changed back to <code>OK</code>.</p>\n<p>{% callout info %}</p>\n<p>Alert notifications are directly tied to the query executions. If a query is scheduled to execute once per week, and is not executed manually by a Redash user, then you will receive one notification per week at most, regardless of the configured <em>Rearm seconds</em>.</p>\n<p>{% endcallout %}</p>\n<h3>Query execution schedule and Rearm seconds</h3>\n<p>The <em>Rearm seconds</em> interval and query schedule are inversely related. If the interval between query executions is shorter, your <em>Rearm seconds</em> value will usually be higher to prevent excessive notifications. If your query only executes once per week, then any <em>Rearm seconds</em> that is shorter than the query execution interval will behave the same way. Most users just use <code>1</code> in this case.</p>\n<p>{% callout info %}</p>\n<p>For a query that executes every 24 hours, any <em>Rearm seconds</em> value between 1 and 86,400 will have the same effect: a notification will be sent every day if the Alert status is <code>TRIGGERED</code>.</p>\n<p>{% endcallout %}</p>\n<p>Imagine you set an Alert on a query that executes every fifteen minutes. You have configured <em>Rearm seconds</em> equal to <code>3600</code> (one hour). This guarantees that you will receive a status notification once an hour if the status is <code>TRIGGERED</code>. But you will also receive a notification if the status changes. The one hour rearm prevents Redash from sending you a notification every fifteen minutes while the Alert is triggered. So in the below time-line:</p>\n<table>\n<thead>\n<tr>\n<th>Time</th>\n<th>Alert Status</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>8:00 AM</td>\n<td>OK</td>\n</tr>\n<tr>\n<td>8:15 AM</td>\n<td>OK</td>\n</tr>\n<tr>\n<td>8:30 AM</td>\n<td>TRIGGERED</td>\n</tr>\n<tr>\n<td>8:45 AM</td>\n<td>TRIGGERED</td>\n</tr>\n<tr>\n<td>9:00 AM</td>\n<td>TRIGGERED</td>\n</tr>\n<tr>\n<td>9:15 AM</td>\n<td>TRIGGERED</td>\n</tr>\n<tr>\n<td>9:30 AM</td>\n<td>TRIGGERED</td>\n</tr>\n<tr>\n<td>9:45 AM</td>\n<td>OK</td>\n</tr>\n<tr>\n<td>10:00 AM</td>\n<td>TRIGGERED</td>\n</tr>\n</tbody>\n</table>\n<p>You would receive the following notifications:</p>\n<table>\n<thead>\n<tr>\n<th>Alert Time</th>\n<th>Alert Message</th>\n<th>Reason</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>8:30 AM</td>\n<td>Status is TRIGGERED</td>\n<td>Status changed</td>\n</tr>\n<tr>\n<td>9:30 AM</td>\n<td>Status is TRIGGERED</td>\n<td>Alert was rearmed</td>\n</tr>\n<tr>\n<td>9:45 AM</td>\n<td>Status is OK</td>\n<td>Status changed</td>\n</tr>\n<tr>\n<td>10:00 AM</td>\n<td>Status is TRIGGERED</td>\n<td>Status changed</td>\n</tr>\n</tbody>\n</table>\n<p>Importantly, assuming the alert was not triggered at all during the nine o'clock hour, the next alert would not arrive until 9:55 AM, the next scheduled query execution after the <em>Rearm seconds</em> was completed.</p>","frontmatter":{"permalink":null,"title":"Setting Up An Alert","description":null,"keywords":["Set up Alert","setup alert","setup an alert","queries with parameters","trigger alert","alert destinations","alert destination"],"parent_category":"user-guide","category":"alerts","toc":true,"layout":null,"hide_topics":null},"parent":{"__typename":"File","relativePath":"kb/user-guide/alerts/setting-up-an-alert.md"}},"Parent":{"frontmatter":{"title":"Alerts"}},"Section":{"name":"User Guide"}},"pageContext":{"category":"alerts","parent_category":"user-guide","slug":"setting-up-an-alert"}}