{"data":{"Article":{"html":"<h2>Setup</h2>\n<p>To add a Google Sheets data source to Redash you first need to create a <a href=\"https://cloud.google.com/iam/docs/understanding-service-accounts\">Service Account</a> with Google. Service Accounts allow third-party applications like Redash to read data from your Google apps without needing to log-in each time. During Service Account setup you will be provided with a JSON key file. You need to upload this file to Redash when setting up the data source.</p>\n<h3>How to create a Google Service Account?</h3>\n<ol>\n<li>Open the <a href=\"https://console.cloud.google.com/apis/credentials\">API Credentials Page</a>. If prompted, select or create a project. </li>\n<li>Click the \"Create credentials\" button. On the dropdown that appears, chose \"Service account key\".</li>\n<li>On the following page, use the dropdown to select the project you elected in step 1. For role select <code>Project > Viewer</code> from the tree menu.</li>\n<li>Under key type, select JSON and hit \"Create\"</li>\n</ol>\n<p>A <code>.json</code> file will then download to your computer. In Redash under Settings, add a new data source for <code>GoogleSpreadsheet</code>. In the modal that appears, name this connection and upload the <code>.json</code> file you downloaded from the Google credentials console. </p>\n<h2>Querying</h2>\n<p>Once you have setup the data source, you can load spreadsheets into Redash. To do so, you need to share the spreadsheet with the Service Account's email address. This can be found in the  <a href=\"https://console.cloud.google.com/apis/api/sheets.googleapis.com/credentials\">Google Sheets API credentials page</a> or in the JSON file under the <code>\"client_email\"</code> key. Sharing is done like you would share with any regular user.</p>\n<p>After the spreadsheet is shared with your Service Account email address, create a new query in Redash and select your Google Sheets data source. In the query editor text box, type your desired Spreadsheet ID. You can optionally select a specific tab of your spreadsheet by adding its tab position as a zero-indexed number separated by a vertical bar or pipe symbol.</p>\n<p>For example:</p>\n<pre><code>1DFuuOMFzNoFQ5EJ2JE2zB79-0uR5zVKvc0EikmvnDgk|0\n</code></pre>\n<p>to load the first sheet or</p>\n<pre><code>1DFuuOMFzNoFQ5EJ2JE2zB79-0uR5zVKvc0EikmvnDgk|1\n</code></pre>\n<p>to load the second. That's the whole query. Leave out any SQL at this point.</p>\n<p>{% callout info %}\n<strong>What is the Spreadsheet ID?</strong></p>\n<p>You can find your Spreadsheet ID in its URL. So for example, if the spreadsheet URL is:</p>\n<pre><code>https://docs.google.com/spreadsheets/d/\nb94d27b9934d3e08a52e52d7da7dabfac484efe37\n</code></pre>\n<p>Then the ID will be:</p>\n<pre><code>b94d27b9934d3e08a52e52d7da7dabfac484efe37\n</code></pre>\n<p>{% endcallout %}</p>\n<p>{% callout warning %}</p>\n<p>This procedure might fail if your organization has restrictions on sharing spreadsheets with external accounts. To improve outcomes, be sure to create the Service Account with a Google account from the same organization. </p>\n<p>{% endcallout %}</p>\n<h3>Filtering The Data</h3>\n<p>When you connect a Google Sheet with Redash, we load it in full. You can generate visualizations from the data and add it to your dashboards. If you want to filter some data or aggregate it beyond what a pivot table can accomplish, you can use one of the following methods:</p>\n<ul>\n<li>Use the <a href=\"%7B%25%20link%20_kb/user-guide/querying/query-results-data-source.md%20%25%7D\">\"Query Results\" data source</a>, which allows you to run queries on top of existing queries.</li>\n<li>Use <a href=\"https://cloud.google.com/blog/big-data/2016/05/bigquery-integrates-with-google-drive\">Google BigQuery's integration with Google Drive</a> to create a Google BigQuery external table based on the Google Spreadsheet.</li>\n</ul>","frontmatter":{"permalink":null,"title":"Querying a Google Spreadsheet","description":null,"keywords":null,"parent_category":"data-sources","category":"querying","toc":null,"layout":null,"hide_topics":null},"parent":{"__typename":"File","relativePath":"kb/data-sources/querying-a-google-spreadsheet.md"}},"Parent":{"frontmatter":{"title":"Querying"}},"Section":{"name":"Data Sources"}},"pageContext":{"category":"querying","parent_category":"data-sources","slug":"google-spreadsheet"}}