{"data":{"Article":{"html":"<h2>'Error: Worker Exited Prematurely: Signal 9 (sigkill)'</h2>\n<p>If you see the error message - \"Error Running Query: Worker exited prematurely: signal 9 (SIGKILL)\" this might indicate the query runner ran out\nof memory - this usually happens with large result sets.</p>\n<p>Try to run the query once more to make sure it wasn't some momentary thing.</p>\n<h2>Queries With Large Data Sets Take A Long Time To Run</h2>\n<p>Sometimes a query with large results (over a few hundred thousand) can take a\nlong time to run.</p>\n<p>Here are a few reasons this might happen:</p>\n<ol>\n<li><strong>Your database</strong> - Redash passes the query AS IS and it's your database's responsibility to handle your query </li>\n<li><strong>Memory of the query runner</strong> (that's us) - there needs to be enough memory to handle the result set. In this case, if the result set is too large, the query might fail and you should see an error. </li>\n<li><strong>Network</strong> - some really large queries might take a while to download. While downloading the results, the UI might still say that the query is being executed while in fact, it's just waiting for the data to reach your browser. </li>\n</ol>\n<p>Another aspect is that the browser needs to be able to render all this data -\nthis varies from visualization to visualization (tables are easier to render).</p>\n<p>{% callout %}\nIMPORTANT TO NOTE: The relevant size (for Redash) is the size of the results.\nYou can query a few rows or terabytes of data, it's all the same for us. It's\nyour database that needs to handle this, while we handle the results.\n{% endcallout %}</p>\n<h2>Status Page (for Hosted Redash)</h2>\n<p>The hosted platform status page can be found at: <a href=\"https://status.redash.io/\">https://status.redash.io/</a>.</p>","frontmatter":{"permalink":"/help/faq/troubleshooting","title":"Troubleshooting","description":null,"keywords":null,"parent_category":"faq","category":"troubleshooting","toc":null,"layout":"kb-category","hide_topics":null},"parent":{"__typename":"File","relativePath":"kb/faq/troubleshooting_category.md"}},"Parent":{"frontmatter":{"title":"Troubleshooting"}},"Section":{"name":"FAQ"}},"pageContext":{"category":"troubleshooting","parent_category":"faq","slug":null}}