{"data":{"Article":{"html":"<h2>Create a New Visualization</h2>\n<p>Once your query has finished running for the first time, you can add a visualization by clicking the “New Visualization” button above the results table.</p>\n<p><img src=\"/assets/images/docs/gitbook/new-viz.png\"></p>\n<h2>Edit A Visualization</h2>\n<p>You can modify the settings of an existing visualization from the query editor screen. Click the visualization on the tab bar and you'll see an <code>Edit Visualization</code> option beneath each visualization. Clicking it will open the current settings for that visualization (type, X axis, Y axis, groupings etc.). Hit \"Save\" to apply your changes or \"Cancel\" to leave no trace.</p>\n<h2>Embedding Visualizations</h2>\n<p>It's easy to embed Redash visualizations. Just click the elipsis button beneath any visualization to show further options and select <code>Embed Elsewhere</code>.</p>\n<img src=\"/assets/images/docs/gitbook/embed-viz.png\" width=\"60%\">\n<p>This will pop up the <code>&#x3C;iframe></code> code you can drop into your HTML pages.</p>\n<p>{% callout warning %}\nQueries with parameters do not support embeds at the moment.\n{% endcallout %}</p>\n<p>For SaaS customers, there is also a hardlink to a PNG of your visualization hosted through <code>snap.redash.io</code>. The PNG embed is especially useful in contexts where iframes won't work (like GitHub issues). </p>\n<p>If you need the visualization PNG to include a <code>Cache-Control: no-cache</code> header, just tack the Query String variable <code>?no-cache</code> to the end of your PNG embed link.</p>\n<h3>Downloading A Visualization as an Image File</h3>\n<p>For chart visualizations, you can also download a local image file. Just hover your mouse near the top right area of the visualization and click the camera icon that appears. A PNG will be downloaded to your device.</p>\n<img src=\"/assets/images/docs/gitbook/download_viz.png\" width=\"60%\">","frontmatter":{"permalink":null,"title":"Visualizations How To","description":null,"keywords":null,"parent_category":"user-guide","category":"visualizations","toc":true,"layout":null,"hide_topics":null},"parent":{"__typename":"File","relativePath":"kb/user-guide/visualizations/visualizations-how-to.md"}},"Parent":{"frontmatter":{"title":"Visualizations"}},"Section":{"name":"User Guide"}},"pageContext":{"category":"visualizations","parent_category":"user-guide","slug":"visualizations-how-to"}}