{"data":{"Article":{"html":"<p>Copy and Paste are a big part of composing database queries. Because it's much easier to duplicate prior work than to write it from scratch. This is particularly true for common <code>JOIN</code> statements or complex <code>CASE</code> expressions. As your list of queries in Redash grows, however, it can be difficult to remember which queries contain the statement you need right now. Enter Query Snippets.</p>\n<p>Query Snippets are segments of queries that your whole team can share and trigger via auto complete. You create them at <code>Settings</code> -> <code>Query Snippets</code>.</p>\n<p><img src=\"/assets/images/docs/gitbook/Snippet.png\"></p>\n<p>Here's an example for a simple snippet:</p>\n<pre><code>JOIN organizations org ON org.id = ${1:table}.org_id\n</code></pre>\n<h2>Insertion Points</h2>\n<p><code>${1:table}</code> is an insertion point with placeholder text. When Redash renders the snippet, the dollar sign <code>$</code> and curly braces <code>{}</code> will be stripped away and the word <code>table</code> will be highlighted for the user to replace.</p>\n<p>{% callout info %}\nYou can use the placeholder text as a desirable default value for the user to override at runtime.\n{% endcallout %}</p>\n<p>You designate insertion points by wrapping an integer tab order with a single dollar sign and curly braces <code>${}</code>. A text placeholder preceded by a colon <code>:</code> is optional but useful for users unfamiliar with your snippet. </p>\n<p>When Redash renders this snippet:</p>\n<pre><code>AND (invoices.complete IS NULL OR invoices.complete &#x3C;> '${2}')\nAND (invoices.canceled IS NULL OR invoices.canceled &#x3C;> '${1}')\nAND (invoices.modified IS NULL OR invoices.modified_date &#x3C;> '${0: this_date}')\n</code></pre>\n<p>The text insertion carat will jump to the second line between the quote marks <code>''</code>. When the user presses <code>Tab</code> the carat will jump <em>backwards</em> onto the first line. When the user presses <code>Tab</code> again, the carat will jump to the third line and <code>this_date</code> will be highlighted to prompt the user for the desired value.</p>\n<p>{% callout info %}\nAn insertion point of zero <code>${0}</code> is always the <em>last</em> point in the tab order.\n{% endcallout %}</p>\n<h2>Insert A Query Snippet</h2>\n<p>If you have Live Auto Complete enabled, you can invoke your snippet from the Query Editor by typing the trigger word you defined in the Query Snippet editor. Auto Complete will suggest it like any other keyword in your database.</p>\n<p>{% callout info %}\nIf you prefer to work without Live Auto Complete enabled you can still invoke Query Snippets by pressing <code>CTRL + Space</code> and typing the trigger word for your Query Snippet.\n{% endcallout %}</p>\n<p>Here are some other ideas for snippets:</p>\n<ul>\n<li>Frequent <code>JOIN</code> statements</li>\n<li>Complicated clauses like <code>WITH</code> or <code>CASE</code>.</li>\n<li><a href=\"https://discuss.redash.io/t/conditional-formatting-general-text-formatting/1706/1\">Conditional Formatting</a></li>\n</ul>","frontmatter":{"permalink":null,"title":"Query Snippets","description":null,"keywords":null,"parent_category":"user-guide","category":"querying","toc":null,"layout":null,"hide_topics":null},"parent":{"__typename":"File","relativePath":"kb/user-guide/querying/query-snippets.md"}},"Parent":{"frontmatter":{"title":"Querying"}},"Section":{"name":"User Guide"}},"pageContext":{"category":"querying","parent_category":"user-guide","slug":"query-snippets"}}