{"data":{"Article":{"html":"<p>Users of Redash can be members of one or more groups. Each new user is added to the <code>Default</code> group automatically. Members of <code>Admin</code> can create new groups, add and remove members from groups, and disable users from accessing Redash entirely. Each group can be connected to specific data sources. Read more about group permissions <a href=\"%7B%25%20link%20_kb/user-guide/users/permissions-groups.md%20%25%7D\">here</a>.</p>\n<h2>Creating &#x26; Editing Groups</h2>\n<p>Only members of <code>Admin</code> can edit or create groups. Go to <code>Settings > Groups</code> and hit <strong>New Group</strong>. Type a name for your new group and the continue.</p>\n<p><img src=\"/assets/images/docs/gitbook/group_settings.png\"></p>\n<p>Add users to your new group by typing their names:</p>\n<p><img src=\"/assets/images/docs/gitbook/view_only_group.png\"></p>\n<p>You can edit details for a group by clicking its name on the groups list in the settings panel. There you can change its name, add or remove users, or associate it with different data sources.</p>\n<p>{% callout info %}\nThe <code>Default</code> and <code>Admin</code> groups can't be deleted.\n{% endcallout %}</p>\n<h2>Making Admins</h2>\n<p>You can make any user an admin. Just add that user to the <code>Admin</code> group. Admins are able to modify data sources, change groups and permissions, disable users, and add further admins. To withdraw admin permissions from a user just remove them from <code>Admin</code> group by following the instructions above.</p>\n<h2>Disabling Users</h2>\n<p>Admins can add a user to the <code>Disabled</code> group from the <code>Settings</code> screen. Find the user on the <code>Users</code> tab and click the <code>Disable</code> button on the right.</p>\n<p><img src=\"/assets/images/docs/gitbook/disable-user.png\"></p>\n<p>Disabled users cannot login to Redash. You can re-enable a disabled user by finding them on the <code>Disabled</code> tab.</p>\n<p>{% callout info %}\nThe <code>Disabled</code> tab does not appear unless you have at least one disabled user.\n{% endcallout %}</p>","frontmatter":{"permalink":null,"title":"Group Management","description":null,"keywords":null,"parent_category":"user-guide","category":"users","toc":null,"layout":null,"hide_topics":null},"parent":{"__typename":"File","relativePath":"kb/user-guide/users/creating-editing-groups.md"}},"Parent":{"frontmatter":{"title":"User, Groups, & Permissions"}},"Section":{"name":"User Guide"}},"pageContext":{"category":"users","parent_category":"user-guide","slug":"creating-editing-groups"}}