{"data":{"Article":{"html":"<p>To make a new query, click <code>Create</code> in the navbar then select <code>Query</code>.</p>\n<p><img src=\"/assets/images/docs/gifs/queries/add_new_query.gif\"></p>\n<h1>Query Editor</h1>\n<h2>Query Syntax</h2>\n<p>In most cases we use the query language native to the data source. In some cases there are differences or additions, which are documented on the <a href=\"%7B%25%20link%20_kb/data-sources/querying%20%25%7D\">Querying Data Sources</a> page.</p>\n<h2>Keyboard Shorcuts</h2>\n<ul>\n<li>Execute query: <code>Ctrl</code>/<code>Cmd</code> + <code>Enter</code></li>\n<li>Save query: <code>Ctrl</code>/<code>Cmd</code> + <code>S</code></li>\n<li>Toggle Auto Complete: <code>Ctrl</code> + <code>Space</code></li>\n<li>Toggle Schema Browser <code>Alt</code>/<code>Option</code> + <code>D</code></li>\n</ul>\n<h2>Schema Browser</h2>\n<p>To the left of the query editor, you will find the Schema Browser:</p>\n<img src=\"/assets/images/docs/gitbook/schema-browser.png\" width=\"60%\">\n<p>The schema browser will list all your tables, and when clicking on a table will show its columns. To insert an item into your query, simply click the double arrow on the right side. You can filter the schema with the search box and refresh it by clicking on the refresh button (otherwise it refreshes periodically in the background).</p>\n<p>{% callout %}\nPlease note that not all data source types support loading the schema.\n{% endcallout %}</p>\n<p>You can hide the Schema Browser using the key shortcut or by double-clicking the pane handle on the interface. This can be useful when you want to maximize screen realestate while composing a query.</p>\n<h2>Auto Complete</h2>\n<p>The query editor also includes an Auto Complete feature that makes writing complicated queries easier. Live Auto Complete is on by default. So you will see table and column suggestions as you type. You can disable Live Auto Complete by clicking the lightning bolt icon beneath the query editor. When Live Auto Complete is disabled, you can still activate Auto Complete by hitting <code>CTRL</code> + <code>Space</code>.</p>\n<p>{% callout %}</p>\n<p>Live Auto Complete is enabled by default unless your database schema exceeds five thousand tokens (tables or columns). In such cases, you can manually trigger Auto Complete using the keyboard shortcut.</p>\n<p>{% endcallout %}</p>\n<p>Auto Complete looks for schema tokens, query syntax identifiers (like <code>SELECT</code> or <code>JOIN</code>) and the titles of <a href=\"%7B%25%20link%20_kb/user-guide/querying/query-snippets%20%25%7D\">Query Snippets</a> </p>\n<h1>Query Settings</h1>\n<h2>Published vs Unpublished Queries</h2>\n<p>By default each query starts as an unpublished draft, which means that:</p>\n<ul>\n<li>Only the user who created this query can see it in the \"All Queries\" list or in search results.</li>\n<li>You can't add visualizations from an unpublished query to dashboards or use it in alerts.</li>\n</ul>\n<p>To publish a query, give it a name or click the <code>Publish</code> button. It's also possible to unpublish a published query by clicking on the <code>Unpublish</code> button in the query menu.</p>\n<h2>Archiving a Query</h2>\n<p>Once a query is no longer useful, you can archive it. Archiving is almost the same as deleting, except that <strong>direct links to the query will still work.</strong> To archive a query, open the little menu at the top-right area of the query editor, next to the Save button and click Archive.</p>\n<p><img src=\"/assets/images/docs/gitbook/archive_query.png\"></p>\n<h2>Duplicating (Forking) a Query</h2>\n<p>If you need to create a copy of an existing query (created by you or someone else), you can fork it. To fork a query, just click on the Fork button (see example below)</p>\n<p><img src=\"/assets/images/docs/gifs/queries/fork_query.gif\"></p>\n<h2>Managing Query Permissions</h2>\n<p>By default, saved queries can only be modified by the user who created them and members of the Admin group. But Redash includes experimental support to share edit permissions with non-Admin users. An Admin in your organization needs to enable it first. Open your organization settings and check the \"Enable experimental multiple owners support\"</p>\n<p><img src=\"/assets/images/docs/gitbook/experimental-owners-support.png\"></p>\n<p>Now the Query Editor options menu includes a <code>Manage Permissions</code> option. Clicking on it it will open a dialog where you can add other users as editors to your query or dashboard.</p>\n<p><img src=\"/assets/images/docs/gitbook/experimental-permissions-button.png\"></p>\n<p>Please note that currently the users you add won't receive a notification, so you will need to notify them manually.</p>","frontmatter":{"permalink":null,"title":"Creating and Editing Queries","description":null,"keywords":null,"parent_category":"user-guide","category":"querying","toc":true,"layout":null,"hide_topics":null},"parent":{"__typename":"File","relativePath":"kb/user-guide/querying/writing-queries.md"}},"Parent":{"frontmatter":{"title":"Querying"}},"Section":{"name":"User Guide"}},"pageContext":{"category":"querying","parent_category":"user-guide","slug":"writing-queries"}}