{"data":{"Article":{"html":"<p>Redash makes it easy to share your dashboards. Just click the <code>Publish</code> button on the upper right of the dashboard editor. Any logged-in member of your organization with adequate permissions can see your dashboard once it has been published. You can also share published dashboards with external users by clicking the share icon in the upper-right. A modal appears where you can generate a secret link to share safely outside your organization. External users can see the dashboard widgets but will not be able to navigate within the Redash application or view the underlying queries.</p>\n<p>{% callout info %}</p>\n<p>You can revoke access to a dashboard for external users by toggling <code>Allow public access</code>. This will break any links to this dashboard that were shared previously. If you toggle the switch again a new secret link will be generated.</p>\n<p>{% endcallout %}</p>\n<p><img src=\"/assets/images/docs/gitbook/turn-on-url-sharing.gif\"></p>\n<h2>Dashboard Permissions</h2>\n<p>A logged-in user will only see dashboard widgets derived from data sources to which the user has access. Users who can view a dashboard widget can also view the underlying query. Should you need to share a dashboard within your organization while also restricting access to the underlying data source, there are two options:</p>\n<ol>\n<li>Give your restricted users access using the secret link method described above</li>\n<li>Create a custom data source for the restricted employees and configure permissions at the database level</li>\n</ol>\n<p>You can read more about Redash's permissions model <a href=\"/help/user-guide/users/permissions-groups\">here</a>. </p>\n<h2>Embedding Dashboards</h2>\n<p>Some users embed their dashboards outside of Redash using iframes. Redash provides a <code>Full Screen</code> view to improve this experience. Full screen mode removes everything but the widget UI. Just click the full screen button to the right of the <code>Refresh</code> button. Then copy the URL from your browser into your iframe embed code.  Embedding a dashboard in this way will require users to be logged-in to Redash. To embed Redash for external users you can use the secret link method described above. Secret links to Redash dashboards are full screen by default.</p>\n<p><img src=\"/assets/images/docs/gitbook/full_screen_button.png\"></p>","frontmatter":{"permalink":null,"title":"Sharing and Embedding Dashboards","description":null,"keywords":null,"parent_category":"user-guide","category":"dashboards","toc":null,"layout":null,"hide_topics":null},"parent":{"__typename":"File","relativePath":"kb/user-guide/dashboards/sharing-dashboards.md"}},"Parent":{"frontmatter":{"title":"Dashboards"}},"Section":{"name":"User Guide"}},"pageContext":{"category":"dashboards","parent_category":"user-guide","slug":"sharing-dashboards"}}