{"data":{"Article":{"html":"<h2>What's Redash?</h2>\n<p>Redash is an open source tool built for teams to query, visualize and\ncollaborate. Redash is quick to setup and works with any data source you might\nneed so you can query from anywhere in no time.</p>\n<p>You can share your results and dashboards with other team members and empower\nyour entire organization to be data driven with no-code filters and parameters\nthat instantly adjust. Get alerts for pre-defined triggers to your email,\nSlack, or Hipchat (you can setup a custom webhook as well).</p>\n<p>Redash is our take on freeing the data within our company in a way that will\nbetter fit our culture and usage patterns. We tried to use traditional BI\nsuites and discovered a set of bloated, technically challenged and slow\ntools/flows. What we were looking for was a more hacker’ish way to look at\ndata, so we built one.</p>\n<p>Redash was built to allow fast and easy access to billions of records, that we\nprocess and collect using Amazon Redshift (“petabyte scale data warehouse”\nthat “speaks” PostgreSQL). Today Redash has support for querying multiple\ndatabases, including: Redshift, Google BigQuery, Google Spreadsheets,\nPostgreSQL, MySQL, Graphite, Axibase Time Series Database and custom scripts.</p>\n<h2>Is Redash compatible with Windows?</h2>\n<p>As a User, you can use Redash from any operating system with a modern browser\n(we recommend Chrome or Firefox). But, if you're looking to run the Open\nSource/Self-Hosted version of Redash then for this, you'll need a Linux server\n(or a VM/Docker container).</p>\n<h2>Browsers Redash Works Best On</h2>\n<p>We recommend using Chrome or Firefox.</p>\n<p>If you encounter any issues that are browser specific, please let us know.</p>","frontmatter":{"permalink":"/help/faq/general","title":"General","description":null,"keywords":null,"parent_category":"faq","category":"general","toc":null,"layout":"kb-category","hide_topics":null},"parent":{"__typename":"File","relativePath":"kb/faq/general_category.md"}},"Parent":{"frontmatter":{"title":"General"}},"Section":{"name":"FAQ"}},"pageContext":{"category":"general","parent_category":"faq","slug":null}}