{"data":{"Article":{"html":"<h3>Data Source Setup Screen</h3>\n<p>When setting up the BigQuery data source, only the <strong>Project ID</strong> and <strong>JSON Key File</strong> are required. If you don't have a JSON key file then you will need to create a new service account (details below).</p>\n<p><img src=\"/assets/images/docs/gitbook/bigquery_mandatories.PNG\"></p>\n<ul>\n<li>\n<p>The <strong>Load Schema</strong> tickbox lets you disable Redash from fetching your BigQuery schema. You may want to do this if your BigQuery instance contains more than ~2500 tokens. Application performance can deteriorate above this threshold because the schema is loaded into your browser on the Query Editor screen.</p>\n</li>\n<li>\n<p>Since BigQuery 2.0, you can use either BigQuery SQL syntax (now called Legacy SQL) or <a href=\"https://cloud.google.com/bigquery/docs/reference/standard-sql/migrating-from-legacy-sql\">Standard SQL Syntax</a>. Redash supports both (Legacy SQL is the default) but this preference applies at the Data Source-level by toggling the <strong>Use Standard SQL</strong> box. Your selection here is passed to BigQuery along with your query text. If some of your queries use Legacy SQL and others use Standard SQL, you can create two data sources.</p>\n</li>\n<li>\n<p>If you enter a <strong>Scanned Data Limit</strong>, Redash will perform a dry-run when you execute your query to check how much data will be processed. And if it is larger than the limit you specify, an error will appear.</p>\n</li>\n<li>\n<p>The <strong>Maximum Billing Tier</strong> is an integer number that Redash can pass along to BigQuery via their API. See <a href=\"https://cloud.google.com/bigquery/docs/reference/rest/v2/JobConfiguration\">their documentation</a>  for more info.</p>\n</li>\n</ul>\n<h3>How to create a Google Service Account?</h3>\n<ol>\n<li>Open the <a href=\"https://console.cloud.google.com/apis/credentials\">API Credentials Page</a>. If prompted, select or create a project. </li>\n<li>Click the \"Create credentials\" button. On the dropdown that appears, chose \"Service account key\".</li>\n<li>On the following page, use the dropdown to select the project you elected in step 1. For role select <code>BigQuery Admin</code> from the tree menu.</li>\n<li>Under key type, select JSON and hit \"Create\"</li>\n</ol>\n<p>A <code>.json</code> file will then download to your computer. Use this when setting up your Data Source.</p>\n<h3>BigQuery Permissions and Roles</h3>\n<p>If you’re using the predefined roles in BigQuery, you need to use the admin\nrole since it's the only one that can create queries and list tables.</p>\n<p>Want to create your own role? The permissions you need to assign are:</p>\n<ul>\n<li>bigquery.jobs.create</li>\n<li>bigquery.jobs.get</li>\n<li>bigquery.jobs.update</li>\n<li>bigquery.datasets.get</li>\n<li>bigquery.tables.list</li>\n<li>bigquery.tables.get</li>\n<li>bigquery.tables.getData</li>\n</ul>","frontmatter":{"permalink":null,"title":"BigQuery Setup","description":null,"keywords":null,"parent_category":"data-sources","category":"setup","toc":true,"layout":null,"hide_topics":null},"parent":{"__typename":"File","relativePath":"kb/data-sources/bigquery-setup.md"}},"Parent":{"frontmatter":{"title":"Setup"}},"Section":{"name":"Data Sources"}},"pageContext":{"category":"setup","parent_category":"data-sources","slug":"bigquery"}}