{"data":{"Article":{"html":"<p>Unless specific to a one-time project, most queries can be reused by changing a <code>WHERE</code> clause (or filter block in NoSQL) to suit the present need. Yet it can be a hassle to <code>Edit Source</code> every time you make a minor change. Query Parameters let you insert values at run time without editing your base query. The syntax is straightforward: Redash recognizes any string between double curly braces <code> {{ }} </code> as a Query Parameter.</p>\n<p>{% raw %}\nSELECT count(0)\nFROM events\nWHERE action = '{{ keyword }}'\n{% endraw %}</p>\n<p>In the above example <code>{{ keyword }}</code> is the Query Parameter. To change the value of the parameter, Redash places an input box above the results pane. The contents of this input box are passed to the database instead of the double curly braces whenever you execute the query.</p>\n<img src=\"/assets/images/docs/gitbook/query-parameter.png\" width=\"100%\">\n<br> \n<h2>Add A Parameter From The UI</h2>\n<p>You can insert a parameter into your query and immediately activate its settings pane by using the <code>Add Parameter</code> button or associated keyboard shortcut. The parameter will be inserted wherever the text caret appears in your query. If you find that you've inserted the parameter in the wrong part of the query, you can select the entire parameter (including the curly braces!) and cut/paste it wherever necessary.</p>\n<p>{% callout %}</p>\n<p>You can discover the key shortcut on your operating system by hovering your cursor above the <code>Add Parameter</code> button.</p>\n<p>{% endcallout %}</p>\n<h3>Parameter Settings</h3>\n<p>You can open a parameter's settings pane by clicking the cog icon on the left:</p>\n<img src=\"/assets/images/docs/gitbook/query-parameter-modalv6.png\" width=\"100%\">\n<ul>\n<li><strong>Title</strong> : by default the parameter title will be the same as the keyword in the query text. If you want to give it a friendlier name, you can change it here.</li>\n<li><strong>Type</strong> : each parameter starts as a Text type. Supported types are Text, Number, Date, Date and Time, Date and Time (with Seconds), and Dropdown List.</li>\n</ul>\n<p>{% callout info %}\nPrior to Redash version 7, the parameter settings pane in the Query Editor included a <code>Global</code> tickbox, which notified Redash that you intended to use this parameter across multiple widgets in a dashboard. The <code>Global</code> tickbox has been replaced since version 6 with the new <em>Parameter Mapping on Dashboards</em> functionality described below.</p>\n<p>{% endcallout %}</p>\n<p>{% callout danger %}</p>\n<p>Query Parameters only work within Redash and are not supported in embeds or shared dashboards. Also, a Redash user must have <a href=\"%7B%25%20link%20_kb/user-guide/users/permissions-groups.md%20%25%7D\">Full Access</a> permission to the data source to use Query Parameters.</p>\n<p>{% endcallout %}</p>\n<h3>Date Parameters</h3>\n<p>With many databases, you can use a string value to represent a date/time which is equivalent to a Text parameter in Redash. Redash's Date parameters are preferable because they have a special calendar interface to make choosing a date easy. If you know in advance, however, that your date parameters will always come from a short list, you can instead use the <code>Dropdown List</code> or <code>Query Based Dropdown List</code> type.</p>\n<p>If you are using Query Parameters of type <code>Date</code>, you can set the parameter's default value to the current date and time when the query is run. While most databases include functions for querying with the current date/time (<code>GETDATE()</code> in TSQL or <code>CURRENT_DATE</code> in MySQL e.g.), this feature in Redash lets you run the <strong>same query</strong> either up-to-the-minute or further in the past.</p>\n<h4>Date Range Parameters</h4>\n<p>For queries that must select data between two dates, Redash provides three levels of Date / Time Range parameters. When chosen from the parameters settings screen, Redash places two complete parameters into your query: one for the start date and one for the end date. You will typically need to separate them in your query (into different <code>WHERE</code> clauses, e.g.). However, the parameter selection interface below the query window displays a unified widget to easily chose a date range without unnecessary clicking.</p>\n<p>Date Range parameters behave exactly like Date parameters but are meant to save you time.</p>\n<h3>Dropdown Lists</h3>\n<p>If you want to restrict the scope of possible parameter values when running a query, you can use Redash's <code>Dropdown List</code> parameter type. When selected from the parameter settings panel, a text box appears where you can enter your allowed values, each one separated by a new line. Dropdown lists are <code>Text</code> parameters under the hood, so if you want to use dates/datetimes in your dropdown, you should enter them in the format your data source requires.</p>\n<h4>Query Based Dropdown List</h4>\n<p>Dropdown lists can also be tied to the results of an existing query. Just click <code>Query Based Dropdown List</code> under <strong>Type</strong> in the settings panel. Search for your target query in the <strong>Query to load dropdown values from</strong> bar. Performance will degrade if your target query returns a large number of records.</p>\n<p>If your target query returns more than one column, Redash uses the <em>first</em> one. If your target query returns <code>name</code> and <code>value</code> columns, Redash populates the parameter selection widget with the <code>name</code> column but executes the query with the associated <code>value</code>.</p>\n<p>For example, suppose this query:</p>\n<p>{% raw %}\nSELECT user_uuid as 'value', username as 'name'\nFROM users\n{% endraw %}</p>\n<p>returned this data:</p>\n<table>\n<thead>\n<tr>\n<th>value</th>\n<th>name</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>1001</td>\n<td>John Smith</td>\n</tr>\n<tr>\n<td>1002</td>\n<td>Jane Doe</td>\n</tr>\n<tr>\n<td>1003</td>\n<td>Bobby Tables</td>\n</tr>\n</tbody>\n</table>\n<p>Redash's dropdown list widget would look like this:</p>\n<img src=\"/assets/images/docs/gitbook/dropdown-list-name-value.png\" width=\"100%\" alt=\"The widget shows John Smith, Jane Doe and Bobby Tables\">\n<p>But when Redash executes the query, the value passed to the database would be 1001, 1002 or 1003.</p>\n<h3>FAQ</h3>\n<p><strong>Can I reuse the same parameter multiple times in a single query?</strong></p>\n<p>Sure! Just use the same identifier in the curly brackets. In this example:</p>\n<pre><code class=\"language-sql\">SELECT {{org_id}}, count(0)\nFROM queries\nWHERE org_id = {{org_id}}\n</code></pre>\n<p>We use the <code>{{org_id}}</code> parameter twice.</p>\n<p><strong>Can I use multiple parameters in a single query?</strong></p>\n<p>Of course, just use a unique name for each one. In this example:</p>\n<pre><code class=\"language-sql\">SELECT count(0)\nFROM queries\nWHERE org_id = {{org_id}} AND created_at > '{{start_date}}'\n</code></pre>\n<p>We use two parameters: <code>{{org_id}}</code> and <code>{{start_date}}</code>.</p>\n<p><strong>Can I use parameters in embedded visualizations?</strong></p>\n<p>Yes, with one exception. If a query uses a Text type parameter, it cannot be embedded because Text parameters are not safe from SQL injection. All other types of query parameters can be safely embedded in visualizations.</p>\n<p><strong>Can I use parameters in shared dashboards?</strong></p>\n<p>No. Dashboards that use query parameters can only be viewed by logged-in Redash users.</p>\n<p>{% callout info %}</p>\n<p>Prior to Version 8 of Redash, parameters were not allowed in embedded visualizations. In a future version, all types of parameters will be allowed on publicly shared dashboards and visualizations. Our hosted platform always runs the latest available version of the app.</p>\n<p>{% endcallout %}</p>\n<h2>Parameter Mapping on Dashboards</h2>\n<p>{% callout %}</p>\n<p>This is currently available on <a href=\"https://app.redash.io/\">Hosted Redash</a> and is part of the next Open Source release (v7.0).</p>\n<p>{% endcallout %}</p>\n<p>Query Parameters can also be powerfully controlled within dashboards. You can link together parameters on different widgets, set static parameter values, or choose values individually for each widget.</p>\n<p>You select your desired parameter mapping when adding dashboard widgets that depend on a parameter value. Each parameter in the underlying query will appear in the <strong>Parameters</strong> list.</p>\n<img src=\"/assets/images/docs/gitbook/dashboard_parameter_mapping.png\" width=\"100%\">\n<p>{% callout info %}\nYou can also access the parameter mapping interface by clicking the three dots on the top right of a dashboard widget, then clicking <code>Edit Parameters</code>.\n{% endcallout %}</p>\n<ul>\n<li>\n<p><strong>Title</strong> is the display name for your parameter and will appear beside the value selector on your dashboard. It defaults to the parameter keyword (see next bullet). Edit it by clicking the pencil glyph. Note that a titles are not displayed for static dashboard parameters because the value selector is hidden. If you select <code>Static value</code> as your Value Source then the Title field will be grayed out.</p>\n</li>\n<li>\n<p><strong>Keyword</strong> is the string literal for this parameter in the underlying query. This is useful for debugging if your dashboard does not return expected results.</p>\n</li>\n<li>\n<p><strong>Default Value</strong> is what Redash will use if no other value is specified.</p>\n</li>\n<li>\n<p><strong>Value Source</strong> is where you choose your preferred mapping. Click the pencil glyph to open the mapper settings.</p>\n</li>\n</ul>\n<h3>Value Source Options</h3>\n<ul>\n<li>\n<p><strong>New dashboard parameter:</strong> Dashboard parameters allow you to set a parameter value in one place on your dashboard and map it to multiple visualizations. Use this option to create a new dashboard-level parameter.</p>\n</li>\n<li>\n<p><strong>Existing dashboard parameter:</strong> If you have already set up a dashboard-level parameter, use this option to map it to a specific query parameter. You will need to specify which pre-existing dashboard parameter will be mapped.</p>\n</li>\n<li>\n<p><strong>Widget parameter:</strong> This option will display a value selector inside your dashboard widget. This is useful for one-off parameters that are not shared between widgets.</p>\n</li>\n<li>\n<p><strong>Static value:</strong> Selecting this option will let you choose a static value for this widget, regardless of the values used on other widgets. Statically mapped parameter values do not display a value selector anywhere on the dashboard which is more compact. This lets you take advantage of the flexibility of Query Parameters without cluttering the user interface on a dashboard when certain parameters are not expected to change frequently.</p>\n</li>\n</ul>","frontmatter":{"permalink":null,"title":"Query Parameters","description":null,"keywords":["variable","variables","template"],"parent_category":"user-guide","category":"querying","toc":true,"layout":null,"hide_topics":null},"parent":{"__typename":"File","relativePath":"kb/user-guide/querying/query-parameters.md"}},"Parent":{"frontmatter":{"title":"Querying"}},"Section":{"name":"User Guide"}},"pageContext":{"category":"querying","parent_category":"user-guide","slug":"query-parameters"}}